Description: |
  Note: munkitools does not include a code signature. If your
  organization requires code signature, it is recommend to internally sign
  the application.
  
  Downloads and imports a pre-built Munki pkg from your own server.
  DOWNLOAD_URL can be overridden to an alternate URL or an alternate package version, 
  ie. https://your.server.com/path/to/munkitools.pkg
  
  The GitHubReleasesInfoProvider processor used by this recipe also
  respects an input variable: 'sort_by_highest_tag_names', which
  if set, will ignore the post dates of the releases and instead sort
  descending by tag names according to LooseVersion semantics.
  
  MUNKI_ICON should be overridden with your icon name.
Identifier: com.github.ggeerraalldd.munkitools-autobuild
Input:
  NAME: munkitools
  DOWNLOAD_URL: https://your.server.com/path/to/munkitools.pkg
  MUNKI_REPO_SUBDIR: munkitools
  MUNKI_ICON: Managed Software Center.png
  pkginfo:
    catalogs:
    - development
    category: munkitools
    description: Managed software installation for macOS.
    developer: The Munki Project
    display_name: Managed Software Center
    icon_name: '%MUNKI_ICON%'
    minimum_os_version: '10.15'
    name: '%NAME%'
    unattended_install: true
MinimumVersion: '2.3'
Process:
- Processor: URLDownloader
  Arguments:
    url: '%DOWNLOAD_URL%'

- Processor: EndOfCheckPhase

- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
    
- Processor: MunkiOptionalReceiptEditor
  Arguments:
    pkg_ids_set_optional_true:
    - com.googlecode.munki.libs
