Description: Downloads latest Basecamp Mac app.
Identifier: com.github.ggeerraalldd.download.Basecamp
MinimumVersion: '2.3'

Input:
  DOWNLOAD_URL: 'https://basecamp.com/desktop/mac%DL_ARCH%/basecamp3%DL_ARCH%.dmg'
Process:
- Processor: URLDownloader
  Arguments:
    filename: Basecamp.dmg
    url: '%DOWNLOAD_URL%'

- Processor: CodeSignatureVerifier
  Arguments:
    requirement: identifier "com.basecamp.basecamp3" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2WNYUYRS7G"
    input_path: '%pathname%/Basecamp.app'

- Processor: EndOfCheckPhase