Description: Downloads the latest version of the DisplayLink Manager App.
Identifier: com.github.ggeerraalldd.download.DisplayLinkManager
MinimumVersion: '2.3'

Input:
  NAME: DisplayLink Manager
  SOFTWARE_TITLE: DisplayLink_Manager
  BASE_URL: https://www.synaptics.com
  SEARCH_URL: products/displaylink-graphics/downloads/macos

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: <.*>DisplayLink Manager Graphics Connectivity<\/.*>.|\n*?a href="(\/.*\?filetype=exe)"
      url: '%BASE_URL%/%SEARCH_URL%'

  - Processor: URLTextSearcher
    Arguments:
      re_pattern: <a.*href="(?P<download_url>.*[.]zip)" download>Accept<\/a>
      url: '%BASE_URL%%match%'

  - Processor: URLDownloader
    Arguments:
      filename: '%SOFTWARE_TITLE%.zip'
      url: '%BASE_URL%%download_url%'

  - Processor: Unarchiver
    Arguments:
      archive_path: '%pathname%'
      destination_path: '%RECIPE_CACHE_DIR%/unzip'
      purge_destination: true

  - Processor: PkgCopier
    Arguments:
      source_pkg: '%RECIPE_CACHE_DIR%/unzip/DisplayLink*.pkg'
      pkg_path: '%RECIPE_CACHE_DIR%/unzip/%SOFTWARE_TITLE%.pkg'

  - Processor: FileFinder
    Arguments:
      pattern: '%RECIPE_CACHE_DIR%/unzip/%SOFTWARE_TITLE%.pkg'

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - 'Developer ID Installer: DisplayLink Corp (73YQY62QM3)'
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: '%found_filename%'