Description: Downloads the latest version of OmniDiskSweeper and imports it into Munki.
Identifier: com.github.ggeerraalldd.munki.OmniDiskSweeper-RSS
MinimumVersion: '2.3'
ParentRecipe: com.github.ggeerraalldd.download.OmniDiskSweeper-RSS

Input:
  MUNKI_REPO_SUBDIR: apps/%NAME%
  NAME: OmniDiskSweeper
  pkginfo:
    catalogs:
    - testing
    description: OmniDiskSweeper is a utility for quickly finding and deleting big, useless files and thus recovering space on your hard disks.
    developer: The Omni Group
    display_name: OmniDiskSweeper
    name: '%NAME%'
    unattended_install: true

Process:
- Arguments:
    dmg_path: '%RECIPE_CACHE_DIR%/%NAME%.dmg'
    dmg_root: '%RECIPE_CACHE_DIR%/%NAME%'
  Processor: DmgCreator

- Arguments:
    pkg_path: '%dmg_path%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
  Processor: MunkiImporter
