Description: Downloads the latest version of Microsoft Remote Desktop Beta and imports it into Munki.
Identifier: com.github.ggeerraalldd.munki.MicrosoftRemoteDesktopBeta
ParentRecipe: com.github.ggeerraalldd.download.MicrosoftRemoteDesktopBeta
MinimumVersion: '2.3'

Input:
  NAME: Microsoft Remote Desktop Beta
  MUNKI_REPO_SUBDIR: apps/%NAME%
  pkginfo:
    catalogs:
    - testing
    description: Connect to Windows machines.
    developer: Microsoft
    display_name: Microsoft Remote Desktop Beta
    name: '%NAME%'
    unattended_install: true

Process:
- Processor: DmgCreator
  Arguments:
    dmg_path: '%RECIPE_CACHE_DIR%/%NAME%.dmg'
    dmg_root: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: MunkiPkginfoMerger
  Arguments:
    additional_pkginfo:
      version: '%version%'

- Processor: MunkiImporter
  Arguments:
    pkg_path: '%dmg_path%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
    version_comparison_key: CFBundleVersion

- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/%NAME%'
    - '%RECIPE_CACHE_DIR%/%NAME%.dmg'
    - '%RECIPE_CACHE_DIR%/downloads'
