Description: Downloads the latest Google Earth Pro
Identifier: com.github.ggeerraalldd.munki.GoogleEarthPro
ParentRecipe: com.github.nstrauss.pkg.GoogleEarthPro
MinimumVersion: '2.3'

Input:
  NAME: GoogleEarthPro
  DERIVE_MIN_OS: ''
  MUNKI_CATEGORY: Utilities
  MUNKI_REPO_SUBDIR: apps/Google/EarthPro
  pkginfo:
    catalogs:
    - testing
    category: '%MUNKI_CATEGORY%'
    description: Google Earth Pro on desktop is available for users with advanced feature needs. Import and export GIS data, and go back in time with historical imagery.
    developer: Google Inc.
    display_name: Google Drive
    name: '%NAME%'
    unattended_install: true

Process:
- Processor: FlatPkgUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/unpack'
    flat_pkg_path: '%pkg_path%'

- Processor: PkgPayloadUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/%NAME%/Applications'
    pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/Google_Earth_Pro.pkg/Payload'

- Processor: MunkiInstallsItemsCreator
  Arguments:
    derive_minimum_os_version: '%DERIVE_MIN_OS%'
    faux_root: '%RECIPE_CACHE_DIR%/%NAME%'
    installs_item_paths:
    - /Applications/Google Earth Pro.app
    version_comparison_key: CFBundleVersion

- Processor: MunkiPkginfoMerger

- Processor: PlistReader
  Arguments:
    info_path: '%RECIPE_CACHE_DIR%/%NAME%/Applications/Google Earth Pro.app/Contents/Info.plist'
    plist_keys:
      LSMinimumSystemVersion: min_os_version

- Processor: MunkiPkginfoMerger
  Arguments:
    additional_pkginfo:
      minimum_os_version: '%min_os_version%'
      version: '%version%'

- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
    version_comparison_key: CFBundleVersion

- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/%NAME%'
    - '%RECIPE_CACHE_DIR%/payload'
    - '%RECIPE_CACHE_DIR%/unpack'
