Description: Downloads the latest version of GoToMeeting.
Identifier: com.github.ggeerraalldd.download.GoToMeeting
MinimumVersion: '2.3'

Input:
  NAME: GoToMeeting

Process:
- Processor: URLDownloader
  Arguments:
    CHECK_FILESIZE_ONLY: true
    filename: '%NAME%.dmg'
    url: https://link.gotomeeting.com/latest-dmg

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/GoToMeeting.app'
    requirement: identifier "com.logmein.GoToMeeting" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = GFNFVT632V

- Processor: Versioner
  Arguments:
    input_plist_path: '%pathname%/GoToMeeting.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString
