Description: Downloads the latest version of GoToMeeting and imports it into Munki.
Identifier: com.github.ggeerraalldd.munki.GoToMeeting
ParentRecipe: com.github.ggeerraalldd.download.GoToMeeting
MinimumVersion: '2.3'

Input:
  NAME: GoToMeeting
  MUNKI_REPO_SUBDIR: apps/%NAME%
  pkginfo:
    catalogs:
    - testing
    description: Online meeting, desktop sharing, and video conferencing software.
    developer: GoTo
    display_name: GoToMeeting
    name: '%NAME%'
    preinstall_script: |
      #!/bin/bash
      
      echo "Removing old copies of GoToMeeting from the /Applications folder..."
      
      rm -rf /Applications/GoToMeeting\ \(*\).app
      
      if [[ -d "/Applications/GoToMeeting" ]]; then
          rm -rf "/Applications/GoToMeeting"
      fi
      
      if [[ -f "/Applications/GoToMeeting.app/Contents/Info.plist" ]]; then
          rm -rf "/Applications/GoToMeeting.app"
      fi
      
      exit 0
    unattended_install: true

Process:
- Processor: MunkiPkginfoMerger
  Arguments:
    additional_pkginfo:
      version: '%version%'

- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
    version_comparison_key: CFBundleVersion
