<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of DCV Viewer.</string>
	<key>Identifier</key>
	<string>com.github.ggeerraalldd.download.DCVViewer</string>
	<key>Input</key>
	<dict>
		<key>BASE_URL</key>
		<string>https://download.nice-dcv.com</string>
		<key>NAME</key>
		<string>nice-dcv-viewer</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
      			<key>re_pattern</key>
      			<string>(https:.*64\.dmg)\">\n\s*macOS\s\(%ARCH%\)</string>
      			<key>result_output_var_name</key>
      			<string>download_url</string>
      			<key>url</key>
      			<string>%BASE_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
      			<key>re_pattern</key>
      			<string>(202\d.\d.\d{4})</string>
      			<key>result_output_var_name</key>
      			<string>raw_version</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>	
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%ARCH%.dmg</string>
				<key>url</key>
				<string>%download_url%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_string</key>
				<string>%raw_version%</string>
				<key>string_to_replace</key>
				<string>-</string>
				<key>replacement_string</key>
				<string>.</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.recipes.commonprocessors/StringReplacer</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/DCV Viewer.app</string>
				<key>requirement</key>
				<string>identifier "com.nicesoftware.dcvviewer" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "94KV3E626L"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
         <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
            <key>Arguments</key>
            <dict>
               <key>version</key>
               <string>%output_string%</string>
            </dict>
         </dict>
	</array>
</dict>
</plist>
