<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of 1Password 8 and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.ggeerraalldd.munki.1Password8</string>
	<key>Input</key>
	<dict>
		<key>ARCH</key>
		<string>x86_64</string>
		<key>DOWNLOAD_URL</key>
		<string>https://downloads.1password.com/mac/1Password-latest-x86_64.zip</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>1Password8</string>
	    <key>STOPPROCESSINGIF_PREDICATE</key>
        <string>download_changed == FALSE</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Utilities</string>
			<key>description</key>
			<string>The world's best password manager is now even more powerful. Designed for uncompromising protection and productivity on macOS.</string>
			<key>developer</key>
			<string>AgileBits Inc.</string>
			<key>display_name</key>
			<string>1Password 8</string>
			<key>minimum_os_version</key>
			<string>10.15.7</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>supported_architectures</key>
			<array>
				<string>%ARCH%</string>
			</array>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.ggeerraalldd.download.1Password8</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
            <dict>
               <key>predicate</key>
               <string>%STOPPROCESSINGIF_PREDICATE%</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>DmgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
