Description: Downloads Meteorologist and imports into Munki.
Identifier: com.github.ggeerraalldd.munki.Meteorologist
MinimumVersion: '2.3'

Input:
  NAME: Meteorologist
  MUNKI_REPO_SUBDIR: apps/%NAME%
  SOURCEFORGE_FILE_PATTERN: Meteorologist-[0-9_\.]*\.dmg
  SOURCEFORGE_PROJECT_NAME: heat-meteo
  APP_DESTINATION: /Applications
  pkginfo:
    catalogs:
    - testing
    description: Meteorologist is a free weather program for OS X.  It allows users total control over their weather viewing, including simultaneous interlaced weather reports from multiple weather servers, multiple weather locations, weather alerts and much more.
    developer: Edward Danley
    display_name: Meteorologist
    name: '%NAME%'
    unattended_install: true

Process:
- Processor: com.github.jessepeterson.munki.GrandPerspective/SourceForgeURLProvider

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.dmg'

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/Meteorologist.app'
    requirement: identifier "com.heat.Meteorologist" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "7WNRPT262U"

- Processor: MunkiImporter
  Arguments:
    additional_makepkginfo_options:
    - --destinationpath
    - '%APP_DESTINATION%'
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
