Description: Downloads the latest version of Tidal.
Identifier: com.github.ggeerraalldd.download.Tidal
MinimumVersion: '2.3'

Input:
  NAME: Tidal

Process:
- Processor: URLDownloader
  Arguments:
    url: https://download.tidal.com/desktop/TIDAL.%DOWNLOAD_ARCH%.dmg

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/TIDAL.app'
    requirement: identifier "com.tidal.desktop" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = GK2243L7KB
