Description: Downloads the latest version of Outset 4 and imports it into Munki.
Identifier: com.github.ggeerraalldd.munki.Outset4
ParentRecipe: com.github.ggeerraalldd.download.Outset4
MinimumVersion: '2.3'

Input:
  NAME: outset
  MUNKI_REPO_SUBDIR: config/%NAME%
  pkginfo:
    catalogs:
    - testing
    description: Automatically process packages, profiles, and scripts during boot, login, or on demand.
    developer: Mac Admins Open Source
    display_name: Outset 4
    minimum_os_version: '10.15'
    name: '%NAME%'
    unattended_install: true
    uninstall_script: '#!/bin/zsh

# Script amended from the pkg preinstall with reference to https://github.com/macadmins/outset/wiki/FAQ#removing-outset

LD_ROOT=&quot;/Library/LaunchDaemons&quot;
LA_ROOT=&quot;/Library/LaunchAgents&quot;

USER_ID=$(id -u &quot;$(/usr/bin/stat -f %Su /dev/console)&quot;)

## LaunchDaemons
DAEMONS=(
    &quot;${LD_ROOT}/com.github.outset.boot.plist&quot;
    &quot;${LD_ROOT}/com.github.outset.cleanup.plist&quot;
    &quot;${LD_ROOT}/com.github.outset.login-privileged.plist&quot;
    &quot;${LD_ROOT}/io.macadmins.outset.boot.plist&quot;
    &quot;${LD_ROOT}/io.macadmins.outset.cleanup.plist&quot;
    &quot;${LD_ROOT}/io.macadmins.outset.login-privileged.plist&quot;
)

## LaunchAgents
AGENTS=(
    &quot;${LA_ROOT}/com.github.outset.login.plist&quot;
    &quot;${LA_ROOT}/com.github.outset.on-demand.plist&quot;
    &quot;${LA_ROOT}/io.macadmins.outset.login.plist&quot;
    &quot;${LA_ROOT}/io.macadmins.outset.login-window.plist&quot;
    &quot;${LA_ROOT}/io.macadmins.outset.on-demand.plist&quot;
)

# Unload if present
for daemon in $DAEMONS; do
    if [ -e &quot;${daemon}&quot; ]; then
        /bin/launchctl bootout system &quot;${daemon}&quot;
        rm -fv &quot;${daemon}&quot;
    fi
done

for agent in $AGENTS; do
    if [ -e &quot;${agent}&quot; ]; then
        if [ ${USER_ID} -ne 0 ]; then
            /bin/launchctl bootout gui/${USER_ID} &quot;${agent}&quot;
        fi
        rm -fv &quot;${agent}&quot;
    fi
done

rm -rfv /usr/local/outset
pkgutil --forget io.macadmins.Outset

exit'

Process:
- Processor: FlatPkgUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/unpack'
    flat_pkg_path: '%pathname%'
    purge_destination: true

- Processor: PkgPayloadUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/%NAME%/usr/local/outset'
    pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/Outset-%version%.pkg/Payload'
    purge_destination: true

- Processor: MunkiInstallsItemsCreator
  Arguments:
    faux_root: '%RECIPE_CACHE_DIR%/Outset'
    installs_item_paths:
    - /usr/local/outset/Outset.app
    purge_destination: true

- Processor: MunkiPkginfoMerger

- Processor: PlistReader
  Arguments:
    info_path: '%RECIPE_CACHE_DIR%/%NAME%/usr/local/outset/Outset.app/Contents/Info.plist'
    plist_keys:
      CFBundleVersion: version
      LSMinimumSystemVersion: min_os_version

- Processor: MunkiPkginfoMerger
  Arguments:
    additional_pkginfo:
      minimum_os_version: '%min_os_version%'
      version: '%version%'

- Processor: MunkiImporter
  Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/downloads/Outset.pkg'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
