<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Changed download source from sparkle to obsproject.com</string>
	<key>Description</key>
	<string>Downloads the latest x86_64 version of OBS Studio.</string>
	<key>Identifier</key>
	<string>com.github.ggeerraalldd.download.OBS</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>OBS</string>
        <key>ARCH</key>
        <string>x86_64</string>        
        <key>RE_PATTERN</key>
        <string>href="(.*?%ARCH%.dmg)"</string>
        <key>SEARCH_URL</key>
        <string>https://obsproject.com/download</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
       <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>%RE_PATTERN%</string>
                <key>result_output_var_name</key>
                <string>download_url</string>
                <key>url</key>
                <string>%SEARCH_URL%</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%APP_FILENAME%-%ARCH%.dmg</string>
                <key>url</key>
                <string>%download_url%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/OBS.app</string>
				<key>requirement</key>
				<string>identifier "com.obsproject.obs-studio" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2MMRE5MTB8"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>