Description: Downloads the latest version of Asana and imports it into Munki.
Identifier: com.github.ggeerraalldd.munki.Asana
ParentRecipe: com.github.ggeerraalldd.download.Asana
MinimumVersion: '2.3'

Input:
  NAME: Asana
  MUNKI_REPO_SUBDIR: apps/%NAME%
  pkginfo:
    catalogs:
    - testing
    description: Enjoy Asana offline.
    developer: Asana, Inc.
    display_name: Asana
    name: '%NAME%'
    unattended_install: true

Process:
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
