Description: Downloads the latest version of Asana.
Identifier: com.github.ggeerraalldd.download.Asana
MinimumVersion: '2.3'

Input:
  NAME: Asana

Process:
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.dmg'
    url: https://desktop-downloads.asana.com/darwin_universal/prod/latest/Asana.dmg

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/Asana.app'
    requirement: identifier "com.electron.asana" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = A679L395M8

- Processor: Versioner
  Arguments:
    input_plist_path: '%pathname%/Asana.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString
