Description: Downloads the latest version of Dropbox.
Identifier: com.github.ggeerraalldd.download.Dropbox
MinimumVersion: '2.3'

Input:
  NAME: Dropbox

Process:
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.dmg'
    url: '%DOWNLOAD_URL%'

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/Dropbox.app'
    requirement: identifier "com.getdropbox.dropbox" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = G7HH3F8CAK

- Processor: Versioner
  Arguments:
    input_plist_path: '%pathname%/Dropbox.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString
