<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest version of the Adobe Creative Cloud Intel Installer and imports it into Munki.
    Set the ARCHITECTURE override to "osx10" to download for Intel, or "macarm64" for Apple Silicon.
    Set the ARCH override to "x86_64" for munki to install or Intel, or "arm64" for Apple Silicon.</string>
    <key>Identifier</key>
    <string>com.github.ggeerraalldd.munki.AdobeCreativeCloudInstaller</string>
    <key>Input</key>
    <dict>
    	<key>ARCHITECTURE</key>
		<string>osx10</string>
		<key>ARCH</key>
		<string>x86_64</string>
        <key>NAME</key>
        <string>Adobe Creative Cloud</string>
        <key>VENDOR</key>
        <string>Adobe</string>
        <key>NAMEWITHOUTSPACES</key>
        <string>CreativeCloudInstaller</string>
        <key>MUNKI_CATEGORY</key>
        <string>Creative Cloud</string>
        <key>MUNKI_DEVELOPER</key>
        <string>Adobe</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Adobe/Creative Cloud</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>developer</key>
            <string>%MUNKI_DEVELOPER%</string>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>description</key>
            <string>Adobe Creative Cloud gives you the world's best creative apps and services so you can make anything you can imagine, whereever you're inspired. </string>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>name</key>
            <string>%NAME%</string>
			<key>supported_architectures</key>
			<array>
				<string>%ARCH%</string>
			</array>
            <key>unattended_install</key>
            <true/>
			<key>uninstall_method</key>
			<string>uninstall_script</string>
			<key>uninstall_script</key>
			<string>#!/bin/bash

# Uninstall the Creative Cloud Desktop app
if [[ -f "/Applications/Utilities/Adobe Creative Cloud/Utils/Creative Cloud Uninstaller.app/Contents/MacOS/Creative Cloud Uninstaller" ]]; then
  echo "Attempting to uninstall Creative Cloud Desktop"
  "/Applications/Utilities/Adobe Creative Cloud/Utils/Creative Cloud Uninstaller.app/Contents/MacOS/Creative Cloud Uninstaller" -u
fi

# Remove pkg receipts

pkgutil --forget com.adobe.AdobeCreativeCloudInstaller.pkg

exit 0</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>2.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.rtrouton.pkg.AdobeCreativeCloudInstaller</string>
    <key>Process</key>
    <array>
      <dict>
          <key>Processor</key>
          <string>MunkiImporter</string>
          <key>Arguments</key>
          <dict>
              <key>pkg_path</key>
              <string>%RECIPE_CACHE_DIR%/%VENDOR%%NAMEWITHOUTSPACES%-%version%.pkg</string>
              <key>repo_subdirectory</key>
              <string>%MUNKI_REPO_SUBDIR%</string>
          </dict>
      </dict>
    </array>
</dict>
</plist>
