<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of erase-install and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.ggeerraalldd.munki.erase-install</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>config/erase-install</string>
		<key>NAME</key>
		<string>erase-install</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
		    <string>macOS</string>
			<key>description</key>
			<string>Upgrade to latest version of macOS Monterey without admin credentials.</string>
			<key>developer</key>
			<string>Macadmins</string>
			<key>display_name</key>
			<string>Upgrade to macOS Monterey</string>
			<key>icon_name</key>
			<string>Install_macOS_Monterey.png</string>
			<key>minimum_os_version</key>
			<string>11.4</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/bin/sh

sleep 3
/Library/Management/erase-install/erase-install.sh --os=12 --reinstall --check-power --cleanup-after-use</string>
			<key>preinstall_alert</key>
			<dict>
				<key>alert_detail</key>
				<string>This will download the latest version of macOS Monterey and upgrade your Mac. Please enter your user password when prompted. 

** The installation process will begin immediately! **
If you are not ready to install now, please
click Cancel and try again later. </string>
			</dict>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0</string>
	<key>ParentRecipe</key>
	<string>com.github.grahampugh.recipes.download.erase-install</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
