Description: Creates a package for latest version of Tunnelblick and imports into Munki.
Identifier: com.github.ggeerraalldd.pkg.Tunnelblick
ParentRecipe: com.github.ggeerraalldd.download.Tunnelblick

Input:
  NAME: Tunnelblick-pkg

Process:
- Processor: PkgRootCreator
  Arguments:
    pkgdirs: {}
    pkgroot: '%RECIPE_CACHE_DIR%/Scripts'

- Processor: PkgRootCreator
  Arguments:
    pkgdirs: {}
    pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'

- Processor: Copier
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/%NAME%/Applications/Tunnelblick.app'
    source_path: '%pathname%/Tunnelblick.app'
    
- Processor: Copier
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/Scripts/Tunnelblick.dmg'
    source_path: '%RECIPE_CACHE_DIR%/downloads/%NAME%-%version%.dmg'

- Processor: FileCreator
  Arguments:
    file_content: |
      #!/bin/bash
        
      # Installer directory location
      install_dir=$(dirname $0)
        
      # Mount Tunnelblick app disk image
      hdiutil attach -nobrowse -quiet $install_dir/Tunnelblick*.dmg
        
      # Remove old Tunnelblick.app from Applications directory
      rm -rf /Applications/Tunnelblick.app
        
      # Move new Tunnelblick.app to Applications directory
      /Volumes/Tunnelblick/Tunnelblick.app/Contents/Resources/installer 3
      sleep 5
        
      # Unmount Tunnelblick app disk image, if necessary
      hdiutil detach -quiet /Volumes/Tunnelblick
        
      # Create folder directories
      /Applications/Tunnelblick.app/Contents/Resources/installer 16
        
      # Run installer process to secure
      /Applications/Tunnelblick.app/Contents/Resources/installer 5
      exit 0
    file_mode: "0755"
    file_path: "%RECIPE_CACHE_DIR%/Scripts/postinstall"

- Processor: PkgCreator
  Arguments:
    pkg_request:
      chown: []
      id: com.sxsw.pkg.Tunnelblick
      options: purge_ds_store
      pkgname: "%NAME%-%version%"
      pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
      pkgtype: flat
      scripts: Scripts
      version: "%version%"