Description: Downloads the current release version of Privileges.app and builds a package.
Identifier: com.github.ggeerraalldd.pkg.privileges
ParentRecipe: com.github.rtrouton.download.privileges
MinimumVersion: '2.3'

Input:
  NAME: Privileges
  INSTALLERSCRIPTS: Scripts

Process:
- Processor: PkgRootCreator
  Arguments:
    pkgdirs:
      Applications/Utilities: '0755'
    pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: Unarchiver
  Arguments:
    archive_path: '%pathname%'
    destination_path: '%pkgroot%/Applications/Utilities'
    purge_destination: true

- Processor: PkgCreator
  Arguments:
    pkg_request:
      chown:
      - group: wheel
        path: Applications/Utilities
        user: root
      id: com.sap.privileges
      options: purge_ds_store
      pkgname: '%NAME%-%version%'
      scripts: '%INSTALLERSCRIPTS%'
      version: '%version%'
