<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release of OBS Studio iOS Camera Plugin release page on Github: https://github.com/wtsnz/obs-ios-camera-source/releases</string>
    <key>Identifier</key>
    <string>com.github.ggeerraalldd.download.OBSStudioCameraPlugin</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>CameraForOBSStudio</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
              	<key>asset_regex</key>
             	<string>^obs-ios-camera-source-.*?macos-universal.pkg$</string>
                <key>github_repo</key>
                <string>wtsnz/obs-ios-camera-source</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%-%version%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>